/*
    homework:
     დაწერეთ პირობითი განცხადება, რომელიც ამოწმებს, არის თუ არა ადამიანის ასაკი 13 წელზე ნაკლები. თუ ასეა, დაბეჭდეთ „ბავშვი ხარ“; თუ ის 13-დან 19-მდეა, ბეჭდვა "შენ ხარ მოზარდი"; წინააღმდეგ შემთხვევაში დაბეჭდეთ „შენ ხარ სრულწლოვანი“.
*/

function main() {
    let age = Number(prompt(`Enter Age: `))

    if (age < 13) {
        return `შენ ხარ ბავშვი`
    }
    else if (age >= 13 && age < 19) {
        return `შენ ხარ მოზარდი`
    }
    else if (age > 19) {
        return `შენ ხარ სრულწლოვანი`
    }
}

console.log(main())