/*
    homework:
    მომხმარებელს შემოატანინეთ ქულა, თუ რიცხვი ტოლია 100, მაშინ გამოიტანეთ, რომ თქვენ დაგიფინანსდათ სწავლა სრულია, თუ ქულა მეტია 70 ზე, მაშინ გამოიტანეთ, თქვენ დაგიფინანსდათ სწავლა 3000 ლარით, თუ შემოტანილი ქულა მეტია 40 ზე, მაშინ გამმოიტანეთ, თქვენ დაგიფინანსდათ სწავლა 1000 ლარით, ხოლო თუ შემოტანილი ქულა ნაკლებია 20 ზე, მაშინ დაწერეთ თქვენ არ დაფინანსდათ სწავლა.
*/

function main() {
    let points = Number(prompt(`Enter Points out of 100`))

    if (points == 100) {
        return `თქვენ დაგიფინანსდათ სწავლა სრულად`
    }
    else if (points >= 70 && points < 100) {
        return `თქვენ დაგიფინანსდათ სწავლა 3000 ლარით`
    }
    else if (points >= 40 && points < 70) {
        return `თქვენ დაგიფინანსდათ სწავლა 1000 ლარით`
    }
    else if (points <= 20 && points < 40) {
        return `თქვენ არ დაგიფინანსდათ სწავლა`
    }
}

console.log(main())