/*

დაწერეთ JavaScript ფუნქცია, რათა შეამოწმოთ, არის თუ არა სტუდენტი უფლებამოსილი სტიპენდიის მისაღებად მათი აკადემიური მოსწრებისა და ოჯახის შემოსავლის მიხედვით. სთხოვეთ მომხმარებელს შეიყვანოს თავისი GPA (საშუალო ქულა) და ოჯახის შემოსავალი. დარწმუნდით, რომ მომხმარებელმა შეიყვანოს დადებითი ნომრები GPA და ოჯახის შემოსავლისთვის. გამოიყენეთ შემდეგი დასაშვებობის კრიტერიუმები: სტუდენტები GPA 3. 5 ან მეტი ადამიანი უფლებამოსილია სტიპენდიის მისაღებად. სტუდენტები, რომლებსაც აქვთ GPA 3.0 ან მეტი და ოჯახის შემოსავალი $50,000-ზე ნაკლები, შეუძლიათ მიიღონ უმაღლესი სტიპენდია. სტუდენტები, რომლებსაც აქვთ GPA 3.0-ზე დაბალი, არ შეუძლიათ სტიპენდიის მიღება. მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, რამდენად შეუძლიათ სტიპენდიის მიღება და სტიპენდიის ოდენობა, თუ ეს შესაძლებელია.

*/

function student(gpa, parentSalary) {
    if (gpa < 0 || parentSalary < 0) {
        return `Error`
    }

    if (gpa >= 3.5) {
        return `Allow`
    }
    else if (gpa > 3 && parentSalary < 50000) {
        return `შეგიძლიათ აიღოთ უმეტესი სტიპენდია`
    }
    else if (gpa < 3) {
        return `Not allowed`
    }
}

console.log(student(Number(prompt(`Enter your GPA`)), Number(prompt(`Enter Parent Salary`))))