/*

    hw: დაწერეთ JavaScript ფუნქცია, რათა შეამოწმოთ, აქვს თუ არა მომხმარებელს ფასდაკლების უფლება მისი ასაკისა და შესყიდვის მთლიანი თანხის მიხედვით. შესთავაზეთ მომხმარებელს შეიყვანოს მათი ასაკი და შესყიდვის მთლიანი თანხა. დარწმუნდით, რომ მომხმარებელმა შეიყვანს დადებითი რიცხვები ასაკისა და შესყიდვის თანხისთვის. გამოიყენეთ შემდეგი ფასდაკლების წესები: 60 წელზე უფროსი ასაკის მომხმარებლებს შეუძლიათ ისარგებლონ ფასდაკლებით.ლიენტებს, რომლებიც ხარჯავენ $100 ან მეტს, შეუძლიათ მიიღონ ფასდაკლება. 60 წელზე უფროსი ასაკის მომხმარებლები და 100 დოლარი ან მეტი დახარჯული აქვთ უფრო მაღალი ფასდაკლების უფლება. მომხმარებლისთვის აჩვენეთ შეტყობინება, რომელშიც მითითებულია, შეუძლიათ თუ არა მას ფასდაკლება და ფასდაკლების ოდენობა, თუ ეს შესაძლებელია.

*/

function shop(age, money) {
    if (age >= 60 && money >= 100) {
        return `Mega Discount`
    }
    else if (age >= 60 && money < 100) {
        return `Discount`
    }
    else if (age < 60 && money >= 100) {
        return `Discount`
    }
    else if (age > 100 || age < 0 || money < 0) {
        return `Error`
    }
    else {
        return `Regular Price`
    }
}

console.log(shop(Number(prompt(`Enter Your Age`)), Number(prompt(`Enter Your Money`))))